Documents/ТребованиеНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ТребованиеНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИзделий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Единица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ТребованиеНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьМатериалыНаСервере()
	Объект.Материалы.Очистить(); 
	Для каждого ТекущаяСтрока Из Объект.Продукция Цикл
		Спецификация = ТекущаяСтрока.Спецификация.ПолучитьОбъект();
		ТаблицаСпецификации = Спецификация.Материалы.Выгрузить();
		//Цикл внутри спецификации
		Для каждого ТекущаяСтрокаСпецификации Из ТаблицаСпецификации Цикл
		НоваяСтрокаПродукции =  Объект.Материалы.Добавить();
		НоваяСтрокаПродукции.Номенклатура = ТекущаяСтрокаСпецификации.Номенклатура;
		НоваяСтрокаПродукции.Количество = ТекущаяСтрокаСпецификации.Количество * ТекущаяСтрока.Количество;
		//НоваяСтрокаПродукции.Записать();
		КонецЦикла;
		//Конец цикла внутри спецификации
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериалы(Команда)
	ДобавитьМатериалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	УпорядочитьТаблицуПоТипамМатериалы();
	УпорядочитьТаблицуПоТипамПродукция();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УпорядочитьТаблицуПоТипамМатериалы()
	Тб=Объект.Материалы.Выгрузить();
	Тб.Колонки.Добавить("Порядок");
	Для Каждого Стр из Тб Цикл
		Стр.Порядок=0+Стр.Номенклатура.Тип.ПорядокОтображения;
	КонецЦикла;
	Тб.Сортировать("Порядок ВОЗР");
	Объект.Материалы.Загрузить(Тб);
КонецПроцедуры

&НаСервере
Процедура УпорядочитьТаблицуПоТипамПродукция()
	Тб=Объект.Продукция.Выгрузить();
	Тб.Колонки.Добавить("Порядок");
	Для Каждого Стр из Тб Цикл
		Стр.Порядок=0+Стр.Номенклатура.Тип.ПорядокОтображения;
	КонецЦикла;
	Тб.Сортировать("Порядок ВОЗР");
	Объект.Продукция.Загрузить(Тб);
КонецПроцедуры

&НаКлиенте
Процедура Анализ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокСсылка", Объект.Ссылка); 
	ОткрытьФорму("Обработка.АнализОстатков.Форма", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПродукцияНоменклатураПриИзмененииНаСервере(Номенклатура)
	ИскНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);
	Спецификация = ИскНоменклатура.ОсновнаяСпецификация.Ссылка;
	Возврат Спецификация;
КонецФункции

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	Номенклатура = ТекСтрока.Номенклатура;

	ТекСтрока.Спецификация = ПродукцияНоменклатураПриИзмененииНаСервере(Номенклатура);
КонецПроцедуры
